{
  "APP": {
    "TITLE": "Luis Medina App",
    "DESCRIPTION": "Portfolio Application of Luis José Medina Sandoval.",
    "PRESENTATIONS": {
      "TITLE": "Luis José Medina Sandoval",
      "DESCRIPTION": "I am a computer engineer and software developer with three years of work experience, including managing corporate software. I am very determined, analytical, and assertive, and I am passionate about learning and solving complex problems.",
      "GITHUB_TITLE": "GitHub",
      "GITHUB_DESCRIPTION": "Here you will find a glimpse of my personal and professional projects. From a young age, I was fascinated by computers, understanding them, and enjoying creating programs that solved problems. Now, I have turned that passion into my professional career.",
      "LINKEDIN_TITLE": "LinkedIn",
      "LINKEDIN_DESCRIPTION": "If you would like more information about my projects, work experience, or any other topic, please don't hesitate to visit my profile on LinkedIn. There you will find all the necessary information to help you feel informed and comfortable.",
      "CV_TITLE": "Curriculum Vitae",
      "CV_DESCRIPTION": "Click here to download my resume and get detailed information about my work experiences, skills, and notable projects.",
      "PROJECTS_TITLE": "Projects",
      "PROJECTS_DESCRIPTION": "Throughout my professional and academic career, I have developed several projects that I will be presenting to you below."
    },
    "PROJECTS": {
      "TITLE": "Projects",
      "DESCRIPTION": "Explore my experience in software development and web solutions throughout my career path. In the section below, you will find details about the most notable projects I have worked on."
    },
    "PROJECT": {
      "APP_LINKS": "App",
      "API_LINKS": "API",
      "FULLSTACK_LINKS": "Full-Stack App",
      "PRESENTATION_LINKS": "Presentation",
      "OTHERS_LINKS": "Others"
    },
    "EXPERIENCE": {
      "TITLE": "Work Experience"
    },
    "CALL_TO_ACTION": {
      "TITLE": "Have You Got Something In Mind?",
      "DESCRIPTION": "Worry Less, Achieve More: Let me help you turn your ideas into reality."
    },
    "SKILLS": {
      "TITLE": "Skills and Technologies",
      "DESCRIPTION": "As a professional, I have acquired a wide range of skills and experience with various technologies.",
      "SKILLS_TITLE": "Skills",
      "TOOLS_TITLE": "Tools"
    },
    "CONTACT": {
      "TITLE": "Contact",
      "SUBTITLE": "CONNECT WITH ME",
      "DESCRIPTION": "Do you have a project in mind? Do you want to discuss an idea or share your opinion? Don't hesitate to contact me. I'm here to listen, address your concerns, and work together toward success. I look forward to hearing from you!",
      "FORM_NAME": "Name",
      "FORM_EMAIL": "Email address",
      "FORM_PHONE": "Phone number",
      "FORM_MESSAGE": "Message",
      "SUCCESS_TITLE": "Form Sent",
      "SUCCESS_TEXT": "“Thank you for your message! I'm delighted to hear from you. I look forward to working together towards success!",
      "LOADING_TITLE": "Sending Form",
      "LOADING_TEXT": "Sending..."
    },
    "FOOTER": {
      "DESCRIPTION": "I am a computer engineer and software developer with three years of work experience, including managing corporate software."
    }
  },
  "DATA": {
    "LINKS": {
      "/": {
        "TITLE": "Home"
      },
      "/#projects": {
        "TITLE": "Projects"
      },
      "/projects": {
        "TITLE": "Projects"
      },
      "/#experience": {
        "TITLE": "Experience"
      },
      "/#skills": {
        "TITLE": "Skills"
      },
      "/assets/luis-medina-cv.pdf": {
        "TITLE": "Download CV"
      },
      "/contact": {
        "TITLE": "Contact me"
      }
    },
    "PROJECTS": {
      "Plataforma Crowdfunding": {
        "TITLE": "Crowdfunding Platform",
        "DESCRIPTION": "A crowdfunding website based on donations to easily manage payments across various platforms and promote social impact projects in Venezuela, aiming to support and bring visibility to people from low-income backgrounds facing need, vulnerability, and other social causes.",
        "NOTE": "Note: Data may be slow to load for the first time, due to limitations on the API host."
      },
      "Romano's Pizza System": {
        "TITLE": "Romano's Pizza System",
        "DESCRIPTION": "A responsive web sales system for a pizzeria, featuring the entire product catalog and combos available from the franchise, providing an accessible interface for order processing, client management, and invoice printing.",
        "NOTE": "Test credentials: user 'admin' and password '1234'."
      },
      "SabedeSeguros Quoters": {
        "TITLE": "SabedeSeguros Quoters",
        "DESCRIPTION": "A web application that provides responsive quote generators for different types of insurance was developed as a WordPress plugin, which can be easily added to the company website. It replaces the need for local Excel files.",
        "NOTE": "Note: The live application runs on a demo page. Images reflect the project's original appearance and functionality on the company's now inactive website."
      },
      "Luis Medina App": {
        "TITLE": "Luis Medina App",
        "DESCRIPTION": "The current professional web portfolio with my work and capabilities."
      },
      "Tomodachi App": {
        "TITLE": "Tomodachi App",
        "DESCRIPTION": "A comprehensive web platform for event management, facilitating ticket, stand, and sponsorship sales. It enables detailed event creation with itineraries, management of ticket types with promotions, and a billing and transaction system. It includes user and role management, along with a dashboard for administering attendees, exhibitors, and sponsors."
      },
      "Cognitive Monitoring App": {
        "TITLE": "Cognitive Monitoring App",
        "DESCRIPTION": "Mobile application developed as a technical test, focusing on the design and implementation of a cognitive monitoring dashboard using React Native. It includes modules for viewing progress, performance, and a user profile, offering an intuitive experience for tracking cognitive metrics."
      },
      "Melissa Barba Real Estate": {
        "TITLE": "Melissa Barba Real Estate",
        "DESCRIPTION": "Modern, responsive landing page for real estate advisor Melissa Barba. Bilingual content (EN/ES) using i18next, section-based navigation, a property search form with validation and notifications, serverless function submission (Vercel), and dynamic SEO (OG/Twitter metadata) via a reusable component."
      },
      "CP Global Insurance": {
        "TITLE": "CP Global Insurance",
        "DESCRIPTION": "Official website for CP Global Insurance (USA) with bilingual content (EN/ES). React + TypeScript SPA with routing for services and business lines; responsive design with Tailwind and accessible Radix components. Includes a language selector with auto-detection, a contact form validated with React Hook Form and toasts, direct call/WhatsApp links, technical SEO (OG/Twitter metadata and JSON‑LD), and deployment on Vercel with a custom domain."
      },
      "All City Gold Website": {
        "TITLE": "All City Gold Website",
        "DESCRIPTION": "Official website for All City Gold jewelry. Responsive landing page with section navigation, subtle animations, and featured collections. Includes a contact form with email sending via a serverless function (Maileroo), basic SEO (OG/Twitter metadata), and deployment on Vercel."
      }
    },
    "EXPERIENCE": {
      "Sabe de Seguros | Desarrollo Web Full-Stack": {
        "TITLE": "Sabe de Seguros | Full-Stack Web Development",
        "DESCRIPTION": "At Sabe de Seguros from January to May 2024, I developed various responsive web quote generators for the company website through a custom WordPress plugin. Leveraging PHP, MySQL, Vue, and Vuetify, I efficiently integrated these quotes into the platform, utilizing WordPress’ content management capabilities to keep the website’s information up-to-date."
      },
      "Universidad Rafael Belloso Chacín | Desarrollo Web Full-Stack": {
        "TITLE": "Rafael Belloso Chacin University | Full-Stack Web Development",
        "DESCRIPTION": "At Rafael Belloso Chacin University from January to April 2024, I developed my undergraduate thesis project: a responsive web crowdfunding application. Using the frameworks FastAPI (Python), React, and Bootstrap, I built this web solution, focusing on creating an adaptable and user-friendly interface that is receptive to different devices."
      },
      "Regalado Group: Bienes Raíces | Encargado de Departamento de Redes": {
        "TITLE": "Regalado Group: Real Estate | Network Department Manager",
        "DESCRIPTION": "At Regalado Group: Real Estate, I served as the Network Department Manager from March 2022 to September 2023. In this role, I managed the company’s commercial website using Joomla CMS as the platform and PHP, HTML, and CSS programming languages. My responsibilities included general website management and updates, as well as administration of properties in the system and corporate data."
      },
      "SysModelers | Desarrollo Web Front-end": {
        "TITLE": "SysModelers | Front-End Web Development",
        "DESCRIPTION": "As a Front-end Web Developer at SysModelers from August 2021 to February 2022, I crafted engaging and accessible UI components using React and CoreUI. This enabled me to build modular, efficient, accessible, and user-centric web applications."
      },
      "Romano's Pizza | Desarrollo Web Full-Stack": {
        "TITLE": "Romano's Pizza | Full-Stack Web Development",
        "DESCRIPTION": "At Romano’s Pizza from July 2021 to November 2022, I spearheaded the development of a customized point-of-sale web application. Leveraging my custom PHP-based framework, along with MySQL, Vue.js, and Vuetify, I designed and implemented a tailored solution that met the specific needs of the restaurant"
      },
      "Corretaje de Seguros ASECA | Gestor de cotizadores Excel": {
        "TITLE": "ASECA Insurance Broker | Excel Quote Manager",
        "DESCRIPTION": "At ASECA Insurance Broker, I worked as an Excel Quote Manager from July 2021 to May 2024. In this role, I was responsible for creating and maintaining Excel files for quotations of international, national, and regional insurance policies. My responsibilities included ensuring the accuracy and constant updating of these quotes, which allowed the company to offer its clients an efficient tool for evaluating different coverage plans."
      }
    }
  },
  "UI": {
    "BUTTON": {
      "EXPLORE": "Explore",
      "GITHUB": "GitHub",
      "LIVE": "Live",
      "LINKEDIN": "LinkedIn",
      "DOWNLOAD_CV": "Download CV",
      "PROJECTS": "Projects",
      "CONTACT_ME": "Contact me",
      "ACCEPT": "Accept",
      "SUBMIT": "Submit",
      "CLOSE": "Close",
      "API_DOCS": "API Docs",
      "FIGMA": "Figma",
      "PROTOTYPE": "Prototype"
    }
  }
}