{
  "APP": {
    "TITLE": "Luis Medina App",
    "DESCRIPTION": "Aplicación de tipo portafolio de Luis José Medina Sandoval",
    "PRESENTATIONS": {
      "TITLE": "Luis José Medina Sandoval",
      "DESCRIPTION": "Soy ingeniero en informática y un desarrollador de software con 3 años de experiencia laboral, incluida la gestión de software empresarial. Me considero muy determinado, analítico y asertivo, con un gran interés por aprender y resolver problemas.",
      "GITHUB_TITLE": "GitHub",
      "GITHUB_DESCRIPTION": "Aquí encontrarás un vistazo a mis proyectos personales y laborales. Desde pequeño, me encantaron las computadoras, entenderlas y disfrutar de crear programas que resolviesen problemas. Ahora, he convertido esa pasión en mi carrera profesional.",
      "LINKEDIN_TITLE": "LinkedIn",
      "LINKEDIN_DESCRIPTION": "Si deseas más información sobre mis proyectos, experiencia laboral o cualquier otro tema, no dudes en visitar mi perfil en LinkedIn. Allí encontrarás toda la información necesaria para que te sientas en el lugar correcto.",
      "CV_TITLE": "Currículum Vitae",
      "CV_DESCRIPTION": "Clickea aquí para descargar mi currículum vitae y obtener información detallada sobre mis experiencias laborales, habilidades y proyectos destacados.",
      "PROJECTS_TITLE": "Proyectos",
      "PROJECTS_DESCRIPTION": "A lo largo de mi carrera profesional y académica he desarrollado varios proyectos que te presento a continuación."
    },
    "PROJECTS": {
      "TITLE": "Proyectos",
      "DESCRIPTION": "Explora mi experiencia en el desarrollo de proyectos de software y soluciones web a lo largo de mi trayectoria. En la sección a continuación, encontrarás detalles sobre los trabajos más destacados que he realizado."
    },
    "PROJECT": {
      "APP_LINKS": "Aplicación",
      "API_LINKS": "API",
      "FULLSTACK_LINKS": "Aplicación Full-Stack",
      "PRESENTATION_LINKS": "Presentación",
      "OTHERS_LINKS": "Otros"
    },
    "EXPERIENCE": {
      "TITLE": "Experiencia laboral"
    },
    "CALL_TO_ACTION": {
      "TITLE": "¿Tienes algo en mente?",
      "DESCRIPTION": "No te quedes con la duda, podemos hacerlo realidad, estoy aquí para ayudarte."
    },
    "SKILLS": {
      "TITLE": "Habilidades y tecnologías",
      "DESCRIPTION": "Como profesional, he adquirido una amplia variedad de habilidades y experiencia con diversas tecnologías.",
      "SKILLS_TITLE": "Habilidades",
      "TOOLS_TITLE": "Herramientas"
    },
    "CONTACT": {
      "TITLE": "Contacto",
      "SUBTITLE": "CONECTEMOS IDEAS",
      "DESCRIPTION": "¿Tiene un proyecto en mente? ¿Desea conversar alguna idea o aportar una opinión? No dude en ponerse en contacto conmigo. Estoy aquí para escuchar, responder a sus inquietudes y que juntos podamos colaborar hacía el éxito. ¡Espero atentamente su mensaje!",
      "FORM_NAME": "Nombre",
      "FORM_EMAIL": "Correo electrónico",
      "FORM_PHONE": "Número telefónico",
      "FORM_MESSAGE": "Mensaje a enviar",
      "SUCCESS_TITLE": "Formulario enviado",
      "SUCCESS_TEXT": "¡Gracias por tu mensaje! Estoy encantado de escucharlo. ¡Espero que podamos trabajar juntos para lograr el éxito!",
      "LOADING_TITLE": "Enviando formulario",
      "LOADING_TEXT": "Enviando..."
    },
    "FOOTER": {
      "DESCRIPTION": "Soy un desarrollador de software con 3 años de experiencia laboral, incluida la gestión de software empresarial."
    }
  },
  "DATA": {
    "LINKS": {
      "/": {
        "TITLE": "Inicio"
      },
      "/#projects": {
        "TITLE": "Proyectos"
      },
      "/projects": {
        "TITLE": "Proyectos"
      },
      "/#experience": {
        "TITLE": "Experiencia"
      },
      "/#skills": {
        "TITLE": "Habilidades"
      },
      "/assets/luis-medina-cv.pdf": {
        "TITLE": "Descargar CV"
      },
      "/contact": {
        "TITLE": "Contáctame"
      }
    },
    "PROJECTS": {
      "Plataforma Crowdfunding": {
        "TITLE": "Plataforma Crowdfunding",
        "DESCRIPTION": "Un sitio web basado en crowdfunding de donación con la finalidad de gestionar pagos fácilmente en distintas plataformas y promocionar proyectos de impacto social en Venezuela, con la intención de apoyar y dar visibilidad a personas de bajo recursos, en un estado de necesidad, vulnerabilidad y todo tipo de causas sociales en general.",
        "NOTE": "Nota: es posible que los datos tarden en cargarse la primera vez, debido a limitaciones en el host de la API."
      },
      "Romano's Pizza System": {
        "TITLE": "Romano's Pizza System",
        "DESCRIPTION": "Un sistema de venta web responsivo para una pizzería, con todo catálogo de productos y combos disponibles de la franquicia, otorgando una interfaz accesible para el procesamiento de pedidos, la gestión de clientes y la impresión de facturas.",
        "NOTE": "Credenciales de prueba: usuario 'admin' y contraseña '1234'."
      },
      "SabedeSeguros Quoters": {
        "TITLE": "SabedeSeguros Quoters",
        "DESCRIPTION": "Una Aplicación que proporciona diversos cotizadores web responsivos para varios tipos de seguros, desarrollados en forma de un plugin de Wordpress para ser agregados fácilmente al sitio web de la empresa, reemplazando el uso de archivos Excel locales.",
        "NOTE": "Nota: La aplicación en vivo opera desde una página de demostración. Las imágenes reflejan la apariencia y funcionalidad original del proyecto en el sitio web de la empresa, el cual se encuentra inactivo."
      },
      "Luis Medina App": {
        "TITLE": "Luis Medina App",
        "DESCRIPTION": "Portafolio web profesional actual de mi persona."
      },
      "Tomodachi App": {
        "TITLE": "Tomodachi App",
        "DESCRIPTION": "Una plataforma web para la gestión integral de eventos, facilitando la venta de entradas, stands y patrocinios. Permite la creación detallada de eventos con itinerarios, la gestión de tipos de tickets con promociones, y un sistema de facturación y transacciones. Incluye gestión de usuarios y roles, y un panel para administrar asistentes, expositores y patrocinadores."
      },
      "Melissa Barba Real Estate": {
        "TITLE": "Melissa Barba Real Estate",
        "DESCRIPTION": "Landing page moderna y responsiva para la asesora inmobiliaria Melissa Barba. Contenido bilingüe (EN/ES) con i18next, navegación por secciones, formulario de búsqueda de propiedades con validación y notificaciones, envío a función serverless (Vercel) y SEO dinámico (metadatos OG/Twitter) mediante un componente reutilizable."
      },
      "CP Global Insurance": {
        "TITLE": "CP Global Insurance",
        "DESCRIPTION": "Sitio web oficial de CP Global Insurance (EE. UU.) con contenido bilingüe (EN/ES). SPA en React + TypeScript con enrutamiento para páginas de servicios y líneas de negocio; diseño responsivo con Tailwind y componentes accesibles de Radix. Incluye selector de idioma con detección automática, formulario de contacto validado con React Hook Form y toasts, enlaces directos a llamada/WhatsApp, SEO técnico (metadatos OG/Twitter y JSON‑LD) y despliegue en Vercel con dominio personalizado."
      },
      "All City Gold Website": {
        "TITLE": "All City Gold Website",
        "DESCRIPTION": "Sitio web oficial de la joyería All City Gold. Landing page responsive con navegación por secciones, animaciones sutiles y colecciones destacadas. Incluye formulario de contacto con envío de correos vía función serverless (Maileroo), SEO básico (metadatos OG/Twitter) y despliegue en Vercel."
      }
    },
    "EXPERIENCE": {
      "Desarrollador Full-Stack | Proyectos Freelance": {
        "TITLE": "Desarrollador Full-Stack | Proyectos Freelance",
        "DESCRIPTION": "Diseñé, desarrollé y desplegué tres sitios web a medida (seguros, bienes raíces y e‑commerce de joyería). Utilicé TypeScript, Tailwind CSS, Node.js, funciones serverless y SQL para entregar soluciones robustas, escalables y responsivas. Proyectos oficiales: CP Global Insurance, All City Gold Jewelry y Melissa Barba Real Estate."
      },
      "Tomodachi Events | Desarrollo Web Full-Stack": {
        "TITLE": "Tomodachi Events | Desarrollo Web Full-Stack",
        "DESCRIPTION": "Mantenimiento y desarrollo de aplicaciones cliente‑servidor internas (gestión de eventos, administración). Stack: TypeScript, React y Express.js/Node.js con PostgreSQL, logrando ~20% de mejora de desempeño mediante optimización de API y consultas/BD."
      },
      "Sabe de Seguros | Desarrollo Web Full-Stack": {
        "TITLE": "Sabe de Seguros | Desarrollo Web Full-Stack",
        "DESCRIPTION": "Desarrollé y administré sistemas de cotización web responsivos con un plugin personalizado de WordPress (PHP, MySQL, Vue, Vuetify), reduciendo el tiempo de cotización en ~40%. Gestioné el CMS de WordPress e integré sistemas de cotizadores basados en Excel, mejorando la eficiencia de datos."
      },
      "Universidad Rafael Belloso Chacín | Desarrollo Web Full-Stack": {
        "TITLE": "Universidad Rafael Belloso Chacín | Desarrollo Web Full-Stack",
        "DESCRIPTION": "Trabajo de grado: desarrollé una aplicación web de crowdfunding responsive con FastAPI (Python), React y Bootstrap, mejorando significativamente la accesibilidad para contribuciones a iniciativas sociales."
      },
      "Regalado Group: Bienes Raíces | Encargado de Departamento de Redes": {
        "TITLE": "Regalado Group: Bienes Raíces | Encargado de Departamento de Redes",
        "DESCRIPTION": "Administración del sitio web comercial y contenido con Joomla CMS; supervisión de listados de inmuebles; soporte directo a usuarios internos/asesores y al equipo de publicidad."
      },
      "SysModelers | Desarrollo Web Front-end": {
        "TITLE": "SysModelers | Desarrollo Web Front-end",
        "DESCRIPTION": "Experiencias UI/UX centradas en el usuario y accesibles con componentes React y CoreUI. Optimización proactiva de funcionalidades CRUD y responsividad mediante mejoras de rendimiento y consultas."
      },
      "Romano's Pizza | Desarrollo Web Full-Stack": {
        "TITLE": "Romano's Pizza | Desarrollo Web Full-Stack",
        "DESCRIPTION": "Proyecto freelance: desarrollo de una aplicación web POS utilizando un framework personal en PHP, MySQL, Vue.js y Vuetify para agilizar ventas y gestión de inventario."
      },
      "Cognitive Monitoring App": {
        "TITLE": "Cognitive Monitoring App",
        "DESCRIPTION": "Aplicación móvil desarrollada como una prueba técnica, enfocada en el diseño y la implementación de un dashboard de monitoreo cognitivo utilizando React Native. Incluye módulos para visualizar el progreso, el rendimiento y un perfil de usuario, ofreciendo una experiencia intuitiva para el seguimiento de métricas cognitivas."
      }
    }
  },
  "UI": {
    "BUTTON": {
      "EXPLORE": "Explorar",
      "GITHUB": "GitHub",
      "LIVE": "En vivo",
      "LINKEDIN": "LinkedIn",
      "DOWNLOAD_CV": "Descargar CV",
      "PROJECTS": "Proyectos",
      "CONTACT_ME": "Contáctame",
      "ACCEPT": "Aceptar",
      "SUBMIT": "Enviar",
      "CLOSE": "Cerrar",
      "API_DOCS": "API Docs",
      "FIGMA": "Figma",
      "PROTOTYPE": "Prototipo"
    }
  }
}